summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD47 */
#define IFX_PSI5_CH_SDRH_SD47_OFF (15)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD48 */
#define IFX_PSI5_CH_SDRH_SD48_OFF (16)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD49 */
#define IFX_PSI5_CH_SDRH_SD49_OFF (17)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD50 */
#define IFX_PSI5_CH_SDRH_SD50_OFF (18)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD51 */
#define IFX_PSI5_CH_SDRH_SD51_OFF (19)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD52 */
#define IFX_PSI5_CH_SDRH_SD52_OFF (20)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD53 */
#define IFX_PSI5_CH_SDRH_SD53_OFF (21)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD54 */
#define IFX_PSI5_CH_SDRH_SD54_OFF (22)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD55 */
#define IFX_PSI5_CH_SDRH_SD55_OFF (23)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD56 */
#define IFX_PSI5_CH_SDRH_SD56_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD57 */
#define IFX_PSI5_CH_SDRH_SD57_OFF (25)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD58 */
#define IFX_PSI5_CH_SDRH_SD58_OFF (26)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD59 */
#define IFX_PSI5_CH_SDRH_SD59_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD60 */
#define IFX_PSI5_CH_SDRH_SD60_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD61 */
#define IFX_PSI5_CH_SDRH_SD61_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD62 */
#define IFX_PSI5_CH_SDRH_SD62_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRH_Bits.SD63 */
#define IFX_PSI5_CH_SDRH_SD63_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_OFF (10)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_OFF (11)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_OFF (12)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_OFF (13)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_OFF (14)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_MSK (0x1)

