summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI29 */
#define IFX_PSI5_MEICLR_MEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI2 */
#define IFX_PSI5_MEICLR_MEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI30 */
#define IFX_PSI5_MEICLR_MEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI31 */
#define IFX_PSI5_MEICLR_MEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI3 */
#define IFX_PSI5_MEICLR_MEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI4 */
#define IFX_PSI5_MEICLR_MEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI5 */
#define IFX_PSI5_MEICLR_MEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI6 */
#define IFX_PSI5_MEICLR_MEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI7 */
#define IFX_PSI5_MEICLR_MEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI8 */
#define IFX_PSI5_MEICLR_MEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI9 */
#define IFX_PSI5_MEICLR_MEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI0 */
#define IFX_PSI5_MEIOV_MEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI10 */
#define IFX_PSI5_MEIOV_MEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI11 */
#define IFX_PSI5_MEIOV_MEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_OFF (21)

