summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI9 */
#define IFX_PSI5_NBISET_NBI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI0 */
#define IFX_PSI5_NFICLR_NFI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI1 */
#define IFX_PSI5_NFICLR_NFI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_MSK (0x1)

