summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.MEI */
#define IFX_PSI5_RDM_H_MEI_OFF (29)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.NBI */
#define IFX_PSI5_RDM_H_NBI_OFF (28)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.NFI */
#define IFX_PSI5_RDM_H_NFI_OFF (30)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.RMI */
#define IFX_PSI5_RDM_H_RMI_OFF (31)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_LEN (3)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.SC */
#define IFX_PSI5_RDM_H_SC_OFF (24)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.TEI */
#define IFX_PSI5_RDM_H_TEI_OFF (27)

/** \\brief  Length for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5_RDM_H_Bits.TS */
#define IFX_PSI5_RDM_H_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_LEN (3)

/** \\brief  Mask for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_RDM_L_Bits.CRC */
#define IFX_PSI5_RDM_L_CRC_OFF (1)

/** \\brief  Length for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDM_L_Bits.CRCI */
#define IFX_PSI5_RDM_L_CRCI_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_LEN (28)

/** \\brief  Mask for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_MSK (0xfffffff)

/** \\brief  Offset for Ifx_PSI5_RDM_L_Bits.RD */
#define IFX_PSI5_RDM_L_RD_OFF (4)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_OFF (31)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_OFF (30)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_LEN (5)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_OFF (16)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_LEN (6)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_MSK (0x3f)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_OFF (0)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_OFF (29)

/** \\brief  Length for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_LEN (6)

/** \\brief  Mask for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_MSK (0x3f)

/** \\brief  Offset for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_OFF (8)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI0 */
#define IFX_PSI5_RMICLR_RMI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI10 */
#define IFX_PSI5_RMICLR_RMI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI11 */
#define IFX_PSI5_RMICLR_RMI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI12 */
#define IFX_PSI5_RMICLR_RMI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI13 */
#define IFX_PSI5_RMICLR_RMI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI14 */
#define IFX_PSI5_RMICLR_RMI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI15 */
#define IFX_PSI5_RMICLR_RMI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RMICLR_Bits.RMI16 */
#define IFX_PSI5_RMICLR_RMI16_OFF (16)

